## Importing Libraries

In [1]:
from sqlalchemy import create_engine
import pandas as pd

## Creating Connection

In [ ]:
DB_USER = "postgres"
DB_PASSWORD = "yourpassword"
DB_HOST = "localhost"
DB_PORT = "5432"
DB_NAME = "ai_learning_db"

engine = create_engine(
    f"postgresql+psycopg2://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
)

print("✅ PostgreSQL connected successfully")

✅ PostgreSQL connected successfully

## Normal Check

In [3]:
pd.read_sql("SELECT version();", engine)

                                             version
0  PostgreSQL 18.1 on x86_64-windows, compiled by...

## Loading csv file into 'df' variable

In [4]:
df = pd.read_csv(r"C:\Users\vchan\Downloads\AI_Student.csv")

## Loading csv file into database

In [5]:
df.to_sql(
    "ai_sessions",
    engine,
    if_exists="replace",   # use replace only first time
    index=False
)

print("✅ Data loaded into PostgreSQL")

✅ Data loaded into PostgreSQL

## Query 1: Checking if everything works alright

In [24]:
query = """
SELECT *
FROM ai_sessions
LIMIT 5;
"""

pd.read_sql(query, engine)

,SessionID,StudentLevel,Discipline,SessionDate,SessionLengthMin,TotalPrompts,TaskType,AI_AssistanceLevel,FinalOutcome,UsedAgain,SatisfactionRating,Year,Month
0,SESSION00001,Undergraduate,Computer Science,03-11-2024,31.20,11,Studying,2,Assignment Completed,True,1.0,2024,11
1,SESSION00002,Undergraduate,Psychology,25-08-2024,13.09,6,Studying,3,Assignment Completed,True,2.0,2024,8
2,SESSION00003,Undergraduate,Business,12-01-2025,19.22,5,Coding,3,Assignment Completed,True,3.3,2025,1
3,SESSION00004,Undergraduate,Computer Science,06-05-2025,3.70,1,Coding,3,Assignment Completed,True,3.5,2025,5
4,SESSION00005,Undergraduate,Psychology,18-03-2025,28.12,9,Writing,3,Assignment Completed,True,2.9,2025,3

## Query 2:Total Sessions done

In [7]:
query = """
select count(*) as total_sessions
from ai_sessions;
"""
print('Total Sessions:')
pd.read_sql(query,engine)

Total Sessions:

   total_sessions
0           10000

## Query 3:Types of Student

In [8]:
query = """
SELECT "StudentLevel",
       COUNT(*) AS types_student
FROM ai_sessions
GROUP BY "StudentLevel"
ORDER BY types_student DESC;
"""
print('Student Level using AI:')
pd.read_sql(query, engine)

Student Level using AI:

    StudentLevel  types_student
0  Undergraduate           5978
1    High School           2027
2       Graduate           1995

## Query 4:Degree of Students and their count

In [9]:
query = """
SELECT "Discipline",COUNT(*) as degree_student
FROM ai_sessions
GROUP BY "Discipline"
ORDER BY degree_student;
"""
print('Feilds of People using AI:')
pd.read_sql(query,engine)

Feilds of People using AI:

         Discipline  degree_student
0          Business            1410
1           History            1417
2        Psychology            1418
3              Math            1422
4       Engineering            1430
5  Computer Science            1445
6           Biology            1458

## Query 5:Avgerage Session time in Minutes

In [10]:
query = """
SELECT AVG("SessionLengthMin") AS AVG_SESSION_TIME_MINS
FROM ai_sessions;
"""
print('Average Session time:')
pd.read_sql(query,engine)

Average Session time:

   avg_session_time_mins
0              19.846467

## Query 6: Average Prompts by user in a session

In [11]:
query = """
SELECT AVG("TotalPrompts") AS AVG_PROMPTS
FROM ai_sessions;
"""
print('')
print('Average Prompts per session:')
pd.read_sql(query,engine)

Average Prompts per session:

   avg_prompts
0       5.6075

## Query 7: Task Type and its count

In [12]:
query = """
SELECT "TaskType",COUNT(*) AS TASK_Count
FROM ai_sessions
GROUP BY "TaskType"
ORDER BY TASK_Count DESC;
"""
print('Task done by people using AI:')
pd.read_sql(query,engine)

Task done by people using AI:

        TaskType  task_count
0        Writing        3101
1       Studying        2040
2  Homework Help        1959
3         Coding        1948
4       Research         476
5  Brainstorming         476

## Query 8: Final Outcome

In [13]:
query = """
SELECT "FinalOutcome",COUNT(*) AS count
FROM ai_sessions
GROUP BY "FinalOutcome"
ORDER BY count DESC;
"""
print('Message People get after using AI:')
pd.read_sql(query,engine)

Message People get after using AI:

           FinalOutcome  count
0  Assignment Completed   4768
1          Idea Drafted   2866
2              Confused   1613
3               Gave Up    753

## Query 9: Do people reuse AI?

In [14]:
query = """
SELECT "UsedAgain",COUNT(*)
FROM ai_sessions
GROUP BY "UsedAgain";
"""
print('Count of people reusing and not reusing AI:')
pd.read_sql(query,engine)

Count of people reusing and not reusing AI:

   UsedAgain  count
0      False   2936
1       True   7064

## Query 10 : Avg Satisfaction Rating

In [15]:
query = """
SELECT AVG("SatisfactionRating") AS AVG_SATISFACTION
FROM ai_sessions;
"""
print('Average Satisfaction Rating of using AI:')
pd.read_sql(query,engine)

Average Satisfaction Rating of using AI:

   avg_satisfaction
0           3.41778

## Query 11:Use of AI within Months

In [16]:
query = """
SELECT "Month",count(*) as ai_use_months
from ai_sessions
group by "Month"
order by ai_use_months desc;
"""
print('Use of AI within Months:')
pd.read_sql(query,engine)

Use of AI within Months:

    Month  ai_use_months
0       8            899
1       6            898
2       1            884
3       7            858
4       5            842
5       4            837
6       9            817
7       3            810
8      11            808
9      10            802
10      2            779
11     12            766

## Query 12: 2024 vs 2025

In [17]:
query = """
SELECT "Year",COUNT(*) AS total_sessions
FROM ai_sessions
GROUP BY "Year"
ORDER BY "Year";
"""
print('Use of AI in following years:')
pd.read_sql(query, engine)

Use of AI in following years:

   Year  total_sessions
0  2024            5158
1  2025            4842

## Query 13: Student Analysis Level Wise

In [18]:
query = """
SELECT "StudentLevel",AVG("SessionLengthMin") as AVG_Session_Length,AVG("TotalPrompts") AS Avg_Prompts
FROM ai_sessions
GROUP BY "StudentLevel"
ORDER BY AVG_Session_Length DESC;
"""
pd.read_sql(query,engine)

    StudentLevel  avg_session_length  avg_prompts
0       Graduate           20.252236     5.787469
1    High School           20.023740     5.619142
2  Undergraduate           19.650943     5.543493

## Query 14: Student Analysis Discpline Wise

In [19]:
query = """
SELECT "Discipline",AVG("SessionLengthMin") as AVG_Session_Length,AVG("TotalPrompts") AS Avg_Prompts
FROM ai_sessions
GROUP BY "Discipline"
ORDER BY AVG_Session_Length DESC;
"""
pd.read_sql(query,engine)

         Discipline  avg_session_length  avg_prompts
0       Engineering           20.143937     5.639161
1           Biology           19.944959     5.657064
2        Psychology           19.903357     5.640339
3          Business           19.884645     5.551064
4           History           19.762816     5.657728
5  Computer Science           19.679170     5.571626
6              Math           19.605113     5.534459

## Query 15: Repeat Rate of Users based on what outcome they got in past

In [20]:
query = """
select "FinalOutcome","UsedAgain",count(*) as count
from ai_sessions
group by "FinalOutcome","UsedAgain"
order by "FinalOutcome", count desc;
"""
pd.read_sql(query,engine)

           FinalOutcome  UsedAgain  count
0  Assignment Completed       True   3844
1  Assignment Completed      False    924
2              Confused      False    965
3              Confused       True    648
4               Gave Up      False    447
5               Gave Up       True    306
6          Idea Drafted       True   2266
7          Idea Drafted      False    600

## Query 16: Satisfaction Rating based on session length

In [21]:
query = """
SELECT CASE WHEN "SatisfactionRating" >= 1 AND "SatisfactionRating" < 2 THEN '1-2' 
WHEN "SatisfactionRating" >= 2 AND "SatisfactionRating" < 3 THEN '2-3'
WHEN "SatisfactionRating" >= 3 AND "SatisfactionRating" < 4 THEN '3-4'
WHEN "SatisfactionRating" >= 4 AND "SatisfactionRating" <= 5 THEN '4-5'
END AS rating, ROUND(AVG("SessionLengthMin")::numeric, 2) AS avg_session_length
FROM ai_sessions
GROUP BY rating
ORDER BY rating;
"""
pd.read_sql(query, engine)

  rating  avg_session_length
0    1-2               20.12
1    2-3               20.08
2    3-4               19.88
3    4-5               19.59

## Query 17 : Use of Assitance Level

In [22]:
query = """
SELECT "AI_AssistanceLevel",
       COUNT(*) AS total_sessions
FROM ai_sessions
GROUP BY "AI_AssistanceLevel"
ORDER BY total_sessions DESC;
"""
pd.read_sql(query, engine)

   AI_AssistanceLevel  total_sessions
0                   4            3451
1                   3            3361
2                   5            1591
3                   2            1356
4                   1             241

## Query 18: Use of Assistance Level Task-Wise

In [23]:
query = """
select "AI_AssistanceLevel","TaskType",count(*) as count
from ai_sessions
group by "AI_AssistanceLevel","TaskType"
order by "AI_AssistanceLevel",count desc;
"""
print(pd.read_sql(query,engine))
print('')
print('AI Assistance Level 3 is consistently the most frequently used level across multiple task types, followed by Level 4, indicating a preference for moderate-to-high AI support rather than minimal or maximum assistance.')

    AI_AssistanceLevel       TaskType  count
0                    1        Writing     75
1                    1       Studying     54
2                    1  Homework Help     46
3                    1         Coding     40
4                    1  Brainstorming     13
5                    1       Research     13
6                    2        Writing    449
7                    2       Studying    293
8                    2  Homework Help    247
9                    2         Coding    241
10                   2  Brainstorming     66
11                   2       Research     60
12                   3        Writing   1003
13                   3  Homework Help    675
14                   3         Coding    667
15                   3       Studying    667
16                   3       Research    181
17                   3  Brainstorming    168
18                   4        Writing   1087
19                   4       Studying    711
20                   4         Coding    673
21                   4  Homework Help    656
22                   4  Brainstorming    164
23                   4       Research    160
24                   5        Writing    487
25                   5  Homework Help    335
26                   5         Coding    327
27                   5       Studying    315
28                   5  Brainstorming     65
29                   5       Research     62

AI Assistance Level 3 is consistently the most frequently used level across multiple task types, followed by Level 4, indicating a preference for moderate-to-high AI support rather than minimal or maximum assistance.

## Q19 : Why do students use ai for at smaller extent?

In [33]:
query = """
SELECT "StudentLevel","TaskType", count(*) as a
from ai_sessions
group by "StudentLevel","TaskType"
order by "TaskType",a desc;
"""
print('Undergraduates use AI the Most')
pd.read_sql(query,engine)

Undergraduates use AI the Most

     StudentLevel       TaskType     a
0   Undergraduate  Brainstorming   287
1        Graduate  Brainstorming    99
2     High School  Brainstorming    90
3   Undergraduate         Coding  1176
4        Graduate         Coding   399
5     High School         Coding   373
6   Undergraduate  Homework Help  1165
7        Graduate  Homework Help   399
8     High School  Homework Help   395
9   Undergraduate       Research   265
10       Graduate       Research   114
11    High School       Research    97
12  Undergraduate       Studying  1216
13    High School       Studying   442
14       Graduate       Studying   382
15  Undergraduate        Writing  1869
16    High School        Writing   630
17       Graduate        Writing   602

## Query 20: Why do students use AI for at broader Extent?

In [31]:
query = """
SELECT "Discipline","TaskType", count(*) as a
from ai_sessions
group by "Discipline","TaskType"
order by "TaskType",a desc;
"""
pd.read_sql(query,engine)

          Discipline       TaskType    a
0           Business  Brainstorming   73
1        Engineering  Brainstorming   72
2         Psychology  Brainstorming   71
3               Math  Brainstorming   71
4   Computer Science  Brainstorming   67
5            History  Brainstorming   61
6            Biology  Brainstorming   61
7            Biology         Coding  302
8   Computer Science         Coding  282
9         Psychology         Coding  280
10       Engineering         Coding  279
11           History         Coding  278
12          Business         Coding  271
13              Math         Coding  256
14           Biology  Homework Help  301
15  Computer Science  Homework Help  282
16       Engineering  Homework Help  281
17           History  Homework Help  281
18              Math  Homework Help  277
19        Psychology  Homework Help  272
20          Business  Homework Help  265
21           History       Research   83
22  Computer Science       Research   74
23        Psychology       Research   73
24              Math       Research   70
25          Business       Research   67
26       Engineering       Research   62
27           Biology       Research   47
28  Computer Science       Studying  313
29           Biology       Studying  312
30          Business       Studying  296
31       Engineering       Studying  287
32        Psychology       Studying  284
33              Math       Studying  278
34           History       Studying  270
35              Math        Writing  470
36       Engineering        Writing  449
37           History        Writing  444
38        Psychology        Writing  438
39          Business        Writing  438
40           Biology        Writing  435
41  Computer Science        Writing  427

In [29]:
print('Across all disciplines, Writing is the most common use case for AI-assisted sessions, followed by Studying, indicating a strong preference for AI support in content creation and learning activities.')

Across all disciplines, Writing is the most common use case for AI-assisted sessions, followed by Studying, indicating a strong preference for AI support in content creation and learning activities.

In [30]:
query = """
SELECT "TaskType", COUNT(*) AS total_sessions
FROM ai_sessions
GROUP BY "TaskType"
ORDER BY total_sessions DESC;
"""
pd.read_sql(query, engine)

        TaskType  total_sessions
0        Writing            3101
1       Studying            2040
2  Homework Help            1959
3         Coding            1948
4  Brainstorming             476
5       Research             476

## Query 21: What is the relationship between total AI prompts, task type, and final outcome?

In [37]:
query = """
SELECT "TaskType","FinalOutcome",SUM("TotalPrompts") AS total_prompts
FROM ai_sessions
GROUP BY "TaskType", "FinalOutcome"
ORDER BY "TaskType", total_prompts DESC;
"""
pd.read_sql(query, engine)

         TaskType          FinalOutcome  total_prompts
0   Brainstorming          Idea Drafted         1443.0
1   Brainstorming  Assignment Completed          828.0
2   Brainstorming              Confused          448.0
3   Brainstorming               Gave Up          266.0
4          Coding  Assignment Completed         6227.0
5          Coding          Idea Drafted         2080.0
6          Coding              Confused         1850.0
7          Coding               Gave Up          616.0
8   Homework Help  Assignment Completed         5800.0
9   Homework Help          Idea Drafted         2375.0
10  Homework Help              Confused         1937.0
11  Homework Help               Gave Up         1042.0
12       Research          Idea Drafted          955.0
13       Research  Assignment Completed          755.0
14       Research              Confused          597.0
15       Research               Gave Up          413.0
16       Studying  Assignment Completed         4734.0
17       Studying          Idea Drafted         3235.0
18       Studying              Confused         2225.0
19       Studying               Gave Up         1084.0
20        Writing  Assignment Completed         8238.0
21        Writing          Idea Drafted         6164.0
22        Writing              Confused         1789.0
23        Writing               Gave Up          974.0

## Query 22: Month Wise Total Prompts

In [41]:
query = """
select "Month",SUM("TotalPrompts") as Month_Wise_Prompts
from ai_sessions
group by "Month"
order by Month_Wise_Prompts desc;
"""
print('Generally in Month 6, 7, & 8 Semester exams are conducted for students')
pd.read_sql(query,engine)

Generally in Month 6, 7, & 8 Semester exams are conducted for students

    Month  month_wise_prompts
0       6              5052.0
1       1              5046.0
2       8              5044.0
3       7              4870.0
4       4              4721.0
5       3              4688.0
6       5              4597.0
7      11              4537.0
8       9              4499.0
9      10              4462.0
10     12              4298.0
11      2              4261.0

## Query 23: Students on basis of their discipline resuing ai?

In [46]:
query = """
SELECT "Discipline","UsedAgain", COUNT(*) AS count
FROM ai_sessions
group by "Discipline","UsedAgain"
order by "UsedAgain",count desc;
"""
print('Math People dont use AI soo much as compared to Biology Student')
pd.read_sql(query,engine)

Math People dont use AI soo much as compared to Biology Student

          Discipline  UsedAgain  count
0               Math      False    454
1           Business      False    427
2            Biology      False    419
3   Computer Science      False    416
4         Psychology      False    413
5        Engineering      False    412
6            History      False    395
7            Biology       True   1039
8   Computer Science       True   1029
9            History       True   1022
10       Engineering       True   1018
11        Psychology       True   1005
12          Business       True    983
13              Math       True    968

## Query 24: Average Satisfaction Rating Discipline Wise

In [52]:
query = """
SELECT "Discipline",AVG("SatisfactionRating") AS avg_satisfaction
FROM ai_sessions
GROUP BY "Discipline"
ORDER BY avg_satisfaction DESC;
"""
pd.read_sql(query, engine)

         Discipline  avg_satisfaction
0           Biology          3.450000
1           History          3.438038
2        Psychology          3.432017
3              Math          3.419058
4  Computer Science          3.416263
5          Business          3.387943
6       Engineering          3.380420

## Query 25: Average Session Length Comparision 2024 vs 2025 of AI Model

In [57]:
query = """
select "Year","AI_AssistanceLevel",AVG("SessionLengthMin") AS TOTAL
from ai_sessions
group by "Year","AI_AssistanceLevel"
ORDER BY "Year", "AI_AssistanceLevel";
"""
pd.read_sql(query,engine)

   Year  AI_AssistanceLevel      total
0  2024                   1  21.906034
1  2024                   2  19.704063
2  2024                   3  19.754292
3  2024                   4  20.220561
4  2024                   5  19.351563
5  2025                   1  16.396480
6  2025                   2  20.585725
7  2025                   3  20.046426
8  2025                   4  19.588176
9  2025                   5  19.643246

## Query 26: How does the AI reuse rate change between 2024 and 2025 across different AI assistance levels?

In [59]:
query = """
SELECT "Year","AI_AssistanceLevel",
ROUND(SUM(CASE WHEN "UsedAgain" = TRUE THEN 1 ELSE 0 END)::numeric/ COUNT(*) * 100,2) AS reuse_rate_percentage
FROM ai_sessions
GROUP BY "Year", "AI_AssistanceLevel"
ORDER BY "Year", "AI_AssistanceLevel";
"""
pd.read_sql(query, engine)

   Year  AI_AssistanceLevel  reuse_rate_percentage
0  2024                   1                  70.69
1  2024                   2                  72.05
2  2024                   3                  70.54
3  2024                   4                  70.45
4  2024                   5                  68.63
5  2025                   1                  70.40
6  2025                   2                  70.39
7  2025                   3                  70.73
8  2025                   4                  72.14
9  2025                   5                  68.91